<HTML> 
<HEAD> 
<meta name="author" content="Kim Neunert"> 
<link rel="stylesheet" href="l2pmain.css" type="text/css"> 
<TITLE>Links</TITLE> 
</HEAD> 
<body> 
Was zum Geier ist ein Struktogramm ? Hier der Artikel aus dem Wikipedia:<BR> 
<A HREF="http://de.wikipedia.org/wiki/Struktogramm">http://de.wikipedia.org/wiki/Struktogramm</A><BR> 
<BR> 
 
Hier einige Links zu guten "Konkurrenzprogrammen" zu Struktor:<BR> 
<BR> 
 
<H3> Mazebots</H3>Ein Roboter mu&szlig; so programmiert werden, da&szlig; er selbst&auml;ndig durch ein Labyrinth findet. Die Programmierung l&auml;uft vollst&auml;ndig men&uuml;gesteuert ab. Leider scheint die Firma http://www.innovatus.com pleite gemacht zu haben. Wer einen Link weiss, wo man das Programm in der Trial-Version noch bekommen kann, schickt mir bitte eine Mail.<BR> 

<H3><A HREF="http://de.wikipedia.org/wiki/KaraToJava" target="_top">Kara der Marienk&auml;fer</A></H3> 
In Java programmiert. Ein Marienk&auml;fer bewegt sich auf einer Art Schachfeld. Durch 3 andere Elemente (feste Baumst&uuml;mpfe, aufsammelbare und ablegbare Kleebl&auml;tter und verschiebbare Pilze) wird erheblich mehr Dynamik geschaffen als in Mazebots. Es gibt jede Menge Programmieraufgaben zu l&ouml;sen. Die Programmierung geschieht durch eine Programmierbare Zustandsmaschine, ebenfalls komplett mit der Maus oder wahlweise auch in Java oder sogar als Turingmaschine. Leider sind bei Kara (im Gegensatz zu Mazebots) keine Variablen vorgesehen, daf&uuml;r erzwingt die Zustandmaschine vor dem Programmieren einiges an Konzeptarbeit.  <BR>

<H3><A HREF="http://kaminari.scitec.kobe-u.ac.jp/java/logo/" target="_top">Logo - online und mit Java</A></H3>
Logo ist eine einfache Zeichenprogrammiersprache mit Befehlen wie "stift runter", "vorwärts 50", "drehe 90" und eignet sich auch sehr gut um das konzeptionelle programmatische Denken zu Schulen. Hier eine Onlinevariante.<BR>
<BR> 

<H3><A HREF="http://www.squeak.de/" target="_top">Squeak - ein multimedialer Bauskasten fuer Kinder jeden Alters</A></H3>
Die Squeak-Leute nehmen den Mund schon recht voll. In Amerika wird das Programm tatsächlich schon in Kindergärten eingesetzt. Aber am besten selber überzeugen, nachdem man das Programm installiert hat, gibt es auch einen Browserplugin mit dem man die Onlinebeispiele ausprobieren kann. Smalltalk at it´s best?!
<BR>

<H3><A HREF="http://www-is.informatik.uni-oldenburg.de/~dibo/hamster/index.html" target="_top">Das Hamstermodell</A></H3> 
Entspricht dem Kara-Konzept. Allerdings ist die Programmierung nur in Java m&ouml;glich.<BR> 

<H3><A HREF="http://kaminari.scitec.kobe-u.ac.jp/java/logo/" target="_top">Logo - online und mit Java</A></H3>
Logo ist eine einfache Zeichenprogrammiersprache mit Befehlen wie "stift runter", "vorwärts 50", "drehe 90" und eignet sich auch sehr gut um das konzeptionelle programmatische Denken zu Schulen. Hier eine Onlinevariante.<BR>


<H3><A HREF="http://www.softwareforeducation.com/" target="_top">Assemblersimulator</A></H3> 
Wer wirklich wissen will wie ein Computer funktioniert, der sollte sich mal ein bi&szlig;chen mit Assembler befassen. Hervorragend geht das mit diesem Simulator. Er simuliert 80/86-Maschinenbefehle. Die Register und der Speicher lassen sich zu jederzeit &uuml;berwachen. Programmiert wird in Assembler, der dann in "Maschinencode" &uuml;bersetzt wird. Damit es spannender wird, ist ein und Ausgabe m&ouml;glich. Au&szlig;erdem gibt es eine steuerbare virtuelle Ampelanlage, ein Aufzug und noch einige andere Elemente.<BR> 
 
<H3><A HREF="http://www.inf.fu-berlin.de/inst/ag-lfwb/murus/Robi/">Karel der Roboter</A></H3> 
programmierbarer virtueller Roboter.<BR> 

<BR> 
<H3><a href="http://mathsrv.ku-eichstaett.de/MGF/homes/grothmann/zul.html" target="new">Zirkel und Lineal von Rene Grothmann</a></H3> 
Hat nichts mit Programmierung zu tun, ist aber sehr stark mit Struktor verwandt. Mit diesem Java-Programm können Konstruktionen mit Zirkel und Lineal estellt werden, die man dann bequem in Webseiten einbetten kann. 



<BR><BR><BR> 
<div class="declare"> 
Mit dem Urteil vom 12.September 1999 - 312 O 85/99 - "Haftung f&uuml;r Links" hat das Landgericht Hamburg entschieden, da&szlig; man durch die Anbringung eines Links, die Inhalte der gelinkten Seite ggf. mit zu verantworten hat. Dies kann - so das LG - nur dadurch verhindert werden, da&szlig; man sich ausdr&uuml;cklich von diesen Inhalten distanziert. Hiermit distanziere ich mich ausdr&uuml;cklich von den Inhalten aller gelinkten Seiten, diese Erkl&auml;rung gilt f&uuml;r alle auf diesen Webseiten angebrachten Links.</div> 
 
</BODY> 
</HTML>
